Ryan-5853/DroneX/firmware/DroneX_STM32H743_Firmware/User/Driver/ESC/ESC.c
/**
 * @file ESC.c
 * @brief DShot300 驱动：TIM2_CH3/CH4 + DMA，双通道同步输出，兼容 AM32 标准协议。
 *
 * 时序（TIM2 时钟 = 240 MHz，Prescaler = 0，ARR = 799）：
 *   位周期  = 800 ticks = 3.333 us
 *   Bit 1   = 600 ticks，75%  高电平
 *   Bit 0   = 300 ticks，37.5% 高电平
 *   拖尾空闲 = 若干槽 CCR=0，每槽 1 位时（≈3.33µs）保持低，拉长帧间线空闲
 *
 * 帧格式（16 bits, MSB first）：
 *   [15:5]  11-bit 油门值  0=停转，48..2047=调速范围
 *   [4]     Telemetry 请求位
 *   [3:0]   CRC = nibble0 ^ nibble1 ^ nibble2
 *
 * 硬件资源：
 *   TIM2_CH3 -> PA2 (AF1), DMA1_Stream0, DMAMUX1 请求 TIM2_CH3
 *   TIM2_CH4 -> PA3 (AF1), DMA1_Stream1, DMAMUX1 请求 TIM2_CH4
 *
 * D-Cache 策略：
 *   缓冲区置于普通 SRAM（32 字节对齐），发送前调用 SCB_CleanDCache_by_Addr
 *   确保 CPU 写入已刷入物理 RAM，DMA 读取到正确数据。
 *
 * 双通道独立启动：
 *   此版本 HAL 使用 per-channel ChannelState[6]，CH3 与 CH4 状态相互独立，
 *   可连续调用两次 HAL_TIM_PWM_Start_DMA 而不会产生 HAL_BUSY 冲突。
 */

#include "Driver/ESC/ESC.h"
#include "stm32h7xx_hal.h"
#include <string.h>

/* ────────────────────── DShot300 时序常数 ───────────────────── */
#define DSHOT300_ARR     799U   /* ARR=800-1；位周期=800/240MHz=3.333us */
#define DSHOT300_BIT1    600U   /* 75%  高电平 -> Bit 1 */
#define DSHOT300_BIT0    300U   /* 37.5% 高电平 -> Bit 0 */
#define DSHOT_FRAME_BITS         16U
#define DSHOT_TRAILING_LOW_SLOTS 3U   /* 16 位后连续全低槽数（≈3×3.33µs，与 BF 18 字档同级并略长） */
#define DSHOT_FRAME_LEN  (DSHOT_FRAME_BITS + DSHOT_TRAILING_LOW_SLOTS)
#define TIM2_TX_PSC       0U
#define TIM2_TX_ARR       DSHOT300_ARR
#define TIM2_RX_PSC       23U        /* 240MHz / (23+1) = 10MHz -> 0.1us/tick */
#define TIM2_RX_ARR       0xFFFFFFFFU
#define ESC_RX_MAX_EDGES  48U
#define ESC_RX_TIMEOUT_MS 2U

/* DMA 缓冲字节数，向上取整到 32 字节（D-Cache 行大小）*/
#define DSHOT_BUF_BYTES  (((DSHOT_FRAME_LEN * sizeof(uint32_t)) + 31U) & ~31U)

/* ──────────────────── 内部 HAL 句柄 ─────────────────────────── */
static TIM_HandleTypeDef s_htim2;
static DMA_HandleTypeDef s_hdma_ch3;
static DMA_HandleTypeDef s_hdma_ch4;
static TIM_HandleTypeDef s_htim4_test;  /* PD15 -> TIM4_CH4 PWM 测试输出 */

/* ─── DShot DMA 缓冲 ─────────────────────────────────────────────
 * 必须放在 AXI SRAM（0x24000000）而非 DTCM（0x20000000），
 * 因为 DMA1/DMA2 总线主机无法访问 DTCM。
 * scatter file 已将 .DMA_BUF section 映射到 AXI SRAM。
 * 32 字节对齐保证 SCB_CleanDCache_by_Addr 按整 cache 行操作。
 * ──────────────────────────────────────────────────────────────── */
static uint32_t s_buf_ch3[DSHOT_FRAME_LEN] __attribute__((section(".DMA_BUF"), aligned(32)));
static uint32_t s_buf_ch4[DSHOT_FRAME_LEN] __attribute__((section(".DMA_BUF"), aligned(32)));

/* ──────── 待发送原始值（Set* 写入，ESC_Update 时编帧）─────────  */
static uint16_t s_pending_val[ESC_CH_COUNT];
static uint8_t  s_pending_tel[ESC_CH_COUNT];

/* ──────────────── 调试统计 & DMA 忙标志 ─────────────────────── */
static ESC_DebugInfo_t  s_dbg;
static volatile uint8_t s_dma_busy;

#define DMA_BUSY_CH3_TX  0x01U
#define DMA_BUSY_CH4_TX  0x02U
#define DMA_BUSY_CH3_RX  0x04U
#define DMA_BUSY_CH4_RX  0x08U

/* 双通道 TX：HAL_TIM_PWM_Stop_DMA 会 __HAL_TIM_DISABLE 整颗定时器，先完成的一路会掐死另一路 DMA */
#define ESC_TX_DMA_DONE_CH3  0x01U
#define ESC_TX_DMA_DONE_CH4  0x02U
static volatile uint8_t s_esc_tx_dma_done_bits;
static volatile uint8_t s_esc_tx_expect_mask; /* 本帧实际启动的 TX DMA 通道，用于与 done_bits 对齐后关 TIM */

typedef struct {
    uint32_t edge_dt[ESC_RX_MAX_EDGES];
    uint8_t edge_count;
    uint8_t active;
    uint8_t has_first_capture;
    uint32_t last_capture;
    uint32_t start_ms;
} ESC_RxState_t;

static ESC_RxState_t s_rx[ESC_CH_COUNT];
static ESC_Telemetry_t s_telem[ESC_CH_COUNT];
static uint8_t s_rx_start_pending;
static ESC_Command_t s_service_cmd[ESC_CH_COUNT];
static ESC_ServiceState_t s_service_state[ESC_CH_COUNT];

/* ─────────────────── 空闲态强制拉低（非反转 DShot） ───────────────────
 * 说明：
 *   HAL_TIM_PWM_Stop_DMA 会关闭通道输出；在无外部下拉/上拉时，引脚可能呈现不确定电平。
 *   为确保 DShot 空闲态为“低电平”，每次发送完成后将引脚临时切为 GPIO 推挽输出并拉低；
 *   下一次发送前再切回 AF1_TIM2。
 */
static inline void ESC_PinToGpioLow_PA2(void)
{
    /* ODR=0 */
    GPIOA->BSRR = (1U << (2U + 16U));
    /* 推挽 */
    GPIOA->OTYPER &= ~(1U << 2U);
    /* 无上下拉 */
    GPIOA->PUPDR &= ~(3U << (2U * 2U));
    /* 高速 */
    GPIOA->OSPEEDR = (GPIOA->OSPEEDR & ~(3U << (2U * 2U))) | (3U << (2U * 2U));
    /* 输出模式 MODER=01 */
    GPIOA->MODER   = (GPIOA->MODER   & ~(3U << (2U * 2U))) | (1U << (2U * 2U));
}

static inline void ESC_PinToGpioLow_PA3(void)
{
    GPIOA->BSRR = (1U << (3U + 16U));
    GPIOA->OTYPER &= ~(1U << 3U);
    GPIOA->PUPDR &= ~(3U << (3U * 2U));
    GPIOA->OSPEEDR = (GPIOA->OSPEEDR & ~(3U << (3U * 2U))) | (3U << (3U * 2U));
    GPIOA->MODER   = (GPIOA->MODER   & ~(3U << (3U * 2U))) | (1U << (3U * 2U));
}

static inline void ESC_PinsToAF_TIM2_CH3_CH4(void)
{
    /* AFRL: PA2/PA3 -> AF1 (TIM2) */
    GPIOA->AFR[0] = (GPIOA->AFR[0] & ~(0xFU << (2U * 4U))) | (0x1U << (2U * 4U));
    GPIOA->AFR[0] = (GPIOA->AFR[0] & ~(0xFU << (3U * 4U))) | (0x1U << (3U * 4U));

    /* 推挽 + 无上下拉 + 高速 */
    GPIOA->OTYPER &= ~((1U << 2U) | (1U << 3U));
    GPIOA->PUPDR  &= ~((3U << (2U * 2U)) | (3U << (3U * 2U)));
    GPIOA->OSPEEDR = (GPIOA->OSPEEDR & ~((3U << (2U * 2U)) | (3U << (3U * 2U))))
                   |  ((3U << (2U * 2U)) | (3U << (3U * 2U)));

    /* 复用模式 MODER=10 */
    GPIOA->MODER = (GPIOA->MODER & ~((3U << (2U * 2U)) | (3U << (3U * 2U))))
                 |  ((2U << (2U * 2U)) | (2U << (3U * 2U)));
}

static void ESC_Tim2ConfigTx(void)
{
    s_htim2.Instance->CR1 &= ~TIM_CR1_CEN;
    s_htim2.Instance->PSC  = TIM2_TX_PSC;
    s_htim2.Instance->ARR  = TIM2_TX_ARR;
    s_htim2.Instance->EGR  = TIM_EGR_UG;
}

static void ESC_Tim2ConfigRx(void)
{
    s_htim2.Instance->CR1 &= ~TIM_CR1_CEN;
    s_htim2.Instance->PSC  = TIM2_RX_PSC;
    s_htim2.Instance->ARR  = TIM2_RX_ARR;
    s_htim2.Instance->EGR  = TIM_EGR_UG;
    s_htim2.Instance->CNT  = 0U;
}

static uint8_t gcr5b_to_nibble(uint8_t code)
{
    switch (code) {
        case 0x19: return 0x0;
        case 0x1B: return 0x1;
        case 0x12: return 0x2;
        case 0x13: return 0x3;
        case 0x1D: return 0x4;
        case 0x15: return 0x5;
        case 0x16: return 0x6;
        case 0x17: return 0x7;
        case 0x1A: return 0x8;
        case 0x09: return 0x9;
        case 0x0A: return 0xA;
        case 0x0B: return 0xB;
        case 0x1E: return 0xC;
        case 0x0D: return 0xD;
        case 0x0E: return 0xE;
        case 0x0F: return 0xF;
        default:   return 0xFF;
    }
}

static uint8_t esc_crc4_calc(uint16_t data12)
{
    uint8_t n0 = (uint8_t)(data12 & 0x0FU);
    uint8_t n1 = (uint8_t)((data12 >> 4U) & 0x0FU);
    uint8_t n2 = (uint8_t)((data12 >> 8U) & 0x0FU);
    return (uint8_t)((n0 ^ n1 ^ n2) & 0x0FU);
}

static bool ESC_DecodeTelemetryFromEdges(const ESC_RxState_t *rx, ESC_Telemetry_t *out)
{
    uint8_t bits[40];
    uint8_t bit_count = 0U;
    uint8_t level = 1U;
    uint32_t min_dt = 0xFFFFFFFFU;

