Ryan-5853/DroneX/firmware/DroneX_STM32H743_Firmware/User/Driver/ESC/ESC.c
    if (rx->edge_count < 6U) {
        return false;
    }

    for (uint8_t i = 0U; i < rx->edge_count; i++) {
        uint32_t dt = rx->edge_dt[i];
        if (dt > 0U && dt < min_dt) {
            min_dt = dt;
        }
    }
    if (min_dt == 0xFFFFFFFFU || min_dt == 0U) {
        return false;
    }

    for (uint8_t i = 0U; i < rx->edge_count && bit_count < 40U; i++) {
        uint32_t dt = rx->edge_dt[i];
        uint32_t repeat = (dt + (min_dt / 2U)) / min_dt;
        if (repeat < 1U) { repeat = 1U; }
        if (repeat > 4U) { repeat = 4U; }
        for (uint32_t k = 0U; k < repeat && bit_count < 40U; k++) {
            bits[bit_count++] = level;
        }
        level ^= 1U;
    }

    if (bit_count < 20U) {
        return false;
    }

    uint16_t raw16 = 0U;
    for (uint8_t group = 0U; group < 4U; group++) {
        uint8_t code = 0U;
        for (uint8_t b = 0U; b < 5U; b++) {
            code = (uint8_t)((code << 1U) | bits[group * 5U + b]);
        }
        uint8_t nibble = gcr5b_to_nibble(code);
        if (nibble > 0x0F) {
            return false;
        }
        raw16 = (uint16_t)((raw16 << 4U) | nibble);
    }

    {
        uint16_t data12 = (uint16_t)(raw16 >> 4U);
        uint8_t crc_rx = (uint8_t)(raw16 & 0x0FU);
        uint8_t crc = esc_crc4_calc(data12);
        out->raw_word = raw16;
        out->data_12bit = data12;
        out->crc = crc_rx;
        out->crc_ok = (uint8_t)((crc_rx == crc) || (crc_rx == ((uint8_t)(~crc) & 0x0FU)));
        out->valid = out->crc_ok ? 1U : 0U;
        out->edge_count = rx->edge_count;
        out->timestamp_ms = HAL_GetTick();
        out->updated = 1U;
        return (out->valid != 0U);
    }
}

static void ESC_StopRxChannel(ESC_Channel_t ch)
{
    uint32_t tim_ch = (ch == ESC_CH1) ? TIM_CHANNEL_3 : TIM_CHANNEL_4;
    (void)HAL_TIM_IC_Stop_IT(&s_htim2, tim_ch);
    s_rx[ch].active = 0U;
    if (ch == ESC_CH1) {
        s_dma_busy &= (uint8_t)~DMA_BUSY_CH3_RX;
        ESC_PinToGpioLow_PA2();
    } else {
        s_dma_busy &= (uint8_t)~DMA_BUSY_CH4_RX;
        ESC_PinToGpioLow_PA3();
    }
    s_dbg.dma_busy = s_dma_busy;
}

static void ESC_FinishRxChannel(ESC_Channel_t ch)
{
    ESC_Telemetry_t telem = {0};
    (void)ESC_DecodeTelemetryFromEdges(&s_rx[ch], &telem);
    s_telem[ch] = telem;
    ESC_StopRxChannel(ch);
}

static void ESC_StartRxChannel(ESC_Channel_t ch)
{
    TIM_IC_InitTypeDef ic = {0};
    uint32_t tim_ch = (ch == ESC_CH1) ? TIM_CHANNEL_3 : TIM_CHANNEL_4;

    memset(&s_rx[ch], 0, sizeof(s_rx[ch]));
    s_rx[ch].active = 1U;
    s_rx[ch].start_ms = HAL_GetTick();

    ic.ICPolarity  = TIM_INPUTCHANNELPOLARITY_BOTHEDGE;
    ic.ICSelection = TIM_ICSELECTION_DIRECTTI;
    ic.ICPrescaler = TIM_ICPSC_DIV1;
    ic.ICFilter    = 0U;
    (void)HAL_TIM_IC_ConfigChannel(&s_htim2, &ic, tim_ch);
    (void)HAL_TIM_IC_Start_IT(&s_htim2, tim_ch);

    if (ch == ESC_CH1) {
        s_dma_busy |= DMA_BUSY_CH3_RX;
    } else {
        s_dma_busy |= DMA_BUSY_CH4_RX;
    }
    s_dbg.dma_busy = s_dma_busy;
}

static void ESC_StartPendingRxIfReady(void)
{
    if ((s_dma_busy & (DMA_BUSY_CH3_TX | DMA_BUSY_CH4_TX)) != 0U) {
        return;
    }
    if (s_rx_start_pending == 0U) {
        return;
    }

    ESC_Tim2ConfigRx();
    ESC_PinsToAF_TIM2_CH3_CH4();

    if (s_rx_start_pending & DMA_BUSY_CH3_RX) {
        ESC_StartRxChannel(ESC_CH1);
    }
    if (s_rx_start_pending & DMA_BUSY_CH4_RX) {
        ESC_StartRxChannel(ESC_CH2);
    }
    s_rx_start_pending = 0U;
}

/**
 * 仅关闭单路 PWM+DMA，不执行 __HAL_TIM_DISABLE。
 * HAL_TIM_PWM_Stop_DMA() 会在任一路回调里关掉整颗 TIM，另一路 DMA 无法跑完。
 */
static void ESC_TimPwmStopDmaOneChKeepTimRunning(TIM_HandleTypeDef *htim, uint32_t Channel)
{
    switch (Channel) {
        case TIM_CHANNEL_3:
            __HAL_TIM_DISABLE_DMA(htim, TIM_DMA_CC3);
            (void)HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_CC3]);
            break;
        case TIM_CHANNEL_4:
            __HAL_TIM_DISABLE_DMA(htim, TIM_DMA_CC4);
            (void)HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_CC4]);
            break;
        default:
            return;
    }
    TIM_CCxChannelCmd(htim->Instance, Channel, TIM_CCx_DISABLE);
    if (IS_TIM_BREAK_INSTANCE(htim->Instance) != RESET) {
        __HAL_TIM_MOE_DISABLE(htim);
    }
}

static void ESC_Tim2DisableCounterIfTxDmaDoneMatchesExpect(void)
{
    if (s_esc_tx_expect_mask != 0U &&
        (s_esc_tx_dma_done_bits == s_esc_tx_expect_mask)) {
        __HAL_TIM_DISABLE(&s_htim2);
        s_esc_tx_dma_done_bits = 0U;
        s_esc_tx_expect_mask    = 0U;
    }
}

/* ════════════════════════════════════════════════════════════════
 * 内部：编码一帧 DShot 到 DMA 缓冲
 *   帧格式：[15:5]=throttle  [4]=telemetry  [3:0]=CRC
 * ════════════════════════════════════════════════════════════════ */
static void encode_frame(uint32_t *buf, uint16_t throttle, bool telemetry)
{
    uint16_t packet = (uint16_t)((throttle << 1U) | (telemetry ? 1U : 0U));
    uint16_t crc    = (uint16_t)((packet ^ (packet >> 4U) ^ (packet >> 8U)) & 0x0FU);
    uint16_t frame  = (uint16_t)((packet << 4U) | crc);

    for (uint32_t i = 0U; i < DSHOT_FRAME_BITS; i++) {
        buf[i] = (frame & 0x8000U) ? DSHOT300_BIT1 : DSHOT300_BIT0;
        frame  = (uint16_t)(frame << 1U);
    }
    for (uint32_t i = DSHOT_FRAME_BITS; i < DSHOT_FRAME_LEN; i++) {
        buf[i] = 0U;  /* 拖尾：CCR=0，线保持低 */
    }
}

/* ════════════════════════════════════════════════════════════════
 * HAL MSP 覆盖（覆盖 stm32h7xx_hal_tim.c 中的 __weak 定义）
 *   由 HAL_TIM_PWM_Init 自动调用，完成 GPIO / DMA / NVIC 配置。
 * ════════════════════════════════════════════════════════════════ */
void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim)
{
    if (htim->Instance != TIM2) { return; }

    s_dbg.msp_init_count++;

    /* 1. 外设时钟使能 */
    __HAL_RCC_TIM2_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* 2. GPIO：PA2=TIM2_CH3，PA3=TIM2_CH4，复用 AF1，推挽输出 */
    GPIO_InitTypeDef gpio = {0};
    gpio.Pin       = GPIO_PIN_2 | GPIO_PIN_3;
    gpio.Mode      = GPIO_MODE_AF_PP;
    gpio.Pull      = GPIO_PULLDOWN;
    gpio.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF1_TIM2;
    HAL_GPIO_Init(GPIOA, &gpio);

