Ryan-5853/DroneX/firmware/DroneX_STM32H743_Firmware/User/Driver/ESC/ESC.c
    /* 3. DMA1_Stream0 -> TIM2_CH3（CCR3 为 32-bit，使用 WORD 对齐）*/
    s_hdma_ch3.Instance                 = DMA1_Stream0;
    s_hdma_ch3.Init.Request             = DMA_REQUEST_TIM2_CH3;
    s_hdma_ch3.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    s_hdma_ch3.Init.PeriphInc           = DMA_PINC_DISABLE;
    s_hdma_ch3.Init.MemInc              = DMA_MINC_ENABLE;
    s_hdma_ch3.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    s_hdma_ch3.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    s_hdma_ch3.Init.Mode                = DMA_NORMAL;
    s_hdma_ch3.Init.Priority            = DMA_PRIORITY_MEDIUM;
    s_hdma_ch3.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_hdma_ch3) != HAL_OK) { return; }
    __HAL_LINKDMA(htim, hdma[TIM_DMA_ID_CC3], s_hdma_ch3);

    /* 4. DMA1_Stream1 -> TIM2_CH4 */
    s_hdma_ch4.Instance                 = DMA1_Stream1;
    s_hdma_ch4.Init.Request             = DMA_REQUEST_TIM2_CH4;
    s_hdma_ch4.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    s_hdma_ch4.Init.PeriphInc           = DMA_PINC_DISABLE;
    s_hdma_ch4.Init.MemInc              = DMA_MINC_ENABLE;
    s_hdma_ch4.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    s_hdma_ch4.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    s_hdma_ch4.Init.Mode                = DMA_NORMAL;
    s_hdma_ch4.Init.Priority            = DMA_PRIORITY_MEDIUM;
    s_hdma_ch4.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_hdma_ch4) != HAL_OK) { return; }
    __HAL_LINKDMA(htim, hdma[TIM_DMA_ID_CC4], s_hdma_ch4);

    /* 5. NVIC：DMA 中断优先级 5，低于 PIT（1..3）
     *    确保 ESC 任务不被 DMA 回调抢占；回调在 ESC 任务返回后执行 */
    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
    HAL_NVIC_SetPriority(TIM2_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
}

/* ════════════════════════════════════════════════════════════════
 * IRQ 处理（覆盖 startup_stm32h743xx.s 中的弱定义）
 * ════════════════════════════════════════════════════════════════ */
void DMA1_Stream0_IRQHandler(void)
{
    s_dbg.dma_irq_ch3_count++;
    HAL_DMA_IRQHandler(&s_hdma_ch3);
}

void DMA1_Stream1_IRQHandler(void)
{
    s_dbg.dma_irq_ch4_count++;
    HAL_DMA_IRQHandler(&s_hdma_ch4);
}

void TIM2_IRQHandler(void)
{
    HAL_TIM_IRQHandler(&s_htim2);
}

/* ════════════════════════════════════════════════════════════════
 * HAL 回调：DMA 传输完成
 *
 * 调用链：
 *   HAL_DMA_IRQHandler
 *     -> TIM_DMADelayPulseCplt（HAL 内部）
 *        -> 将通道 ChannelState 置为 READY（DMA_NORMAL 模式）
 *        -> 本函数
 *
 * 双通道 TX：每路完成时只关本路 DMA/CC，两路都完成后再 __HAL_TIM_DISABLE（见上）。
 * ════════════════════════════════════════════════════════════════ */
void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance != TIM2) { return; }

    if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3) {
        s_dbg.pulse_done_ch3_count++;
        ESC_TimPwmStopDmaOneChKeepTimRunning(htim, TIM_CHANNEL_3);
        s_dma_busy &= (uint8_t)~DMA_BUSY_CH3_TX;
        s_esc_tx_dma_done_bits |= ESC_TX_DMA_DONE_CH3;
        ESC_Tim2DisableCounterIfTxDmaDoneMatchesExpect();
        if (s_pending_tel[ESC_CH1]) {
            s_rx_start_pending |= DMA_BUSY_CH3_RX;
        } else {
            ESC_PinToGpioLow_PA2();
        }
    }
    if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4) {
        s_dbg.pulse_done_ch4_count++;
        ESC_TimPwmStopDmaOneChKeepTimRunning(htim, TIM_CHANNEL_4);
        s_dma_busy &= (uint8_t)~DMA_BUSY_CH4_TX;
        s_esc_tx_dma_done_bits |= ESC_TX_DMA_DONE_CH4;
        ESC_Tim2DisableCounterIfTxDmaDoneMatchesExpect();
        if (s_pending_tel[ESC_CH2]) {
            s_rx_start_pending |= DMA_BUSY_CH4_RX;
        } else {
            ESC_PinToGpioLow_PA3();
        }
    }
    ESC_StartPendingRxIfReady();
    s_dbg.dma_busy = s_dma_busy;
}

void HAL_TIM_PWM_PulseFinishedHalfCpltCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance != TIM2) { return; }
    if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3) { s_dbg.pulse_half_ch3_count++; }
    if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4) { s_dbg.pulse_half_ch4_count++; }
}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)
{
    ESC_Channel_t ch;
    uint32_t cap;
    ESC_RxState_t *rx;
    uint32_t dt;

    if (htim->Instance != TIM2) { return; }
    if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3) {
        ch = ESC_CH1;
        cap = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_3);
    } else if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4) {
        ch = ESC_CH2;
        cap = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_4);
    } else {
        return;
    }

    rx = &s_rx[ch];
    if (!rx->active) {
        return;
    }

    if (!rx->has_first_capture) {
        rx->has_first_capture = 1U;
        rx->last_capture = cap;
        return;
    }

    dt = cap - rx->last_capture;
    rx->last_capture = cap;

    if (rx->edge_count < ESC_RX_MAX_EDGES) {
        rx->edge_dt[rx->edge_count] = dt;
        rx->edge_count++;
    } else {
        ESC_FinishRxChannel(ch);
        return;
    }

    if (dt > 120U && rx->edge_count > 8U) { /* 10MHz 下约 12us，视为回传结束间隔 */
        ESC_FinishRxChannel(ch);
    }
}

void HAL_TIM_ErrorCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2) { s_dbg.tim_error_count++; }
}

/* ════════════════════════════════════════════════════════════════
 *                          公开 API
 * ════════════════════════════════════════════════════════════════ */

ESC_Status_t ESC_Init(void)
{
    memset(&s_dbg,        0, sizeof(s_dbg));
    memset(s_buf_ch3,     0, sizeof(s_buf_ch3));
    memset(s_buf_ch4,     0, sizeof(s_buf_ch4));
    memset(s_pending_val, 0, sizeof(s_pending_val));
    memset(s_pending_tel, 0, sizeof(s_pending_tel));
    memset(s_rx,          0, sizeof(s_rx));
    memset(s_telem,       0, sizeof(s_telem));
    memset(s_service_cmd,   0, sizeof(s_service_cmd));
    memset(s_service_state, 0, sizeof(s_service_state));
    s_rx_start_pending = 0U;
    s_dma_busy = 0U;
    s_esc_tx_dma_done_bits = 0U;
    s_esc_tx_expect_mask    = 0U;

    /* TIM2：Prescaler=0 -> 计数频率=240MHz，ARR=799 -> 位周期=3.333us */
    s_htim2.Instance               = TIM2;
    s_htim2.Init.Prescaler         = 0U;
    s_htim2.Init.CounterMode       = TIM_COUNTERMODE_UP;
    s_htim2.Init.Period            = DSHOT300_ARR;
    s_htim2.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    s_htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_PWM_Init(&s_htim2) != HAL_OK) {
        return ESC_ERR_HAL;
    }

    /* PWM Mode1（CNT<CCR->高，CNT>=CCR->低），高极性，预装载禁用 */
    TIM_OC_InitTypeDef oc = {0};
    oc.OCMode     = TIM_OCMODE_PWM1;
    oc.Pulse      = 0U;
    oc.OCPolarity = TIM_OCPOLARITY_HIGH;
    oc.OCFastMode = TIM_OCFAST_DISABLE;
    if (HAL_TIM_PWM_ConfigChannel(&s_htim2, &oc, TIM_CHANNEL_3) != HAL_OK ||
        HAL_TIM_PWM_ConfigChannel(&s_htim2, &oc, TIM_CHANNEL_4) != HAL_OK) {
        return ESC_ERR_HAL;
    }
    ESC_Tim2ConfigTx();

    /* 确保上电后空闲态为低电平 */
    ESC_PinToGpioLow_PA2();
    ESC_PinToGpioLow_PA3();

