Ryan-5853/DroneX/firmware/DroneX_STM32H743_Firmware/User/Driver/ESC/ESC.c
    s_dbg.initialized = 1U;
    return ESC_OK;
}

/* 简单 PWM 输出：PD15 = TIM4_CH4，50Hz，占空比约 1.5ms（兼容标准 PWM 电调/舵机） */
void ESC_TestPwm_StartOnPD15(void)
{
    /* 1. 使能时钟 */
    __HAL_RCC_TIM4_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    /* 2. GPIO：PD15 -> TIM4_CH4 (AF2) */
    GPIO_InitTypeDef gpio = {0};
    gpio.Pin       = GPIO_PIN_15;
    gpio.Mode      = GPIO_MODE_AF_PP;
    gpio.Pull      = GPIO_NOPULL;
    gpio.Speed     = GPIO_SPEED_FREQ_HIGH;
    gpio.Alternate = GPIO_AF2_TIM4;
    HAL_GPIO_Init(GPIOD, &gpio);

    /* 3. TIM4：假定定时器时钟约为 240MHz
     *    PSC=2399 -> 计数频率 100kHz（10us 一计数）
     *    ARR=1999 -> 周期 20000us = 50Hz
     *    CCR4=150 -> 高电平约 150 * 10us = 1.5ms
     */
    s_htim4_test.Instance               = TIM4;
    s_htim4_test.Init.Prescaler         = 2399U;
    s_htim4_test.Init.CounterMode       = TIM_COUNTERMODE_UP;
    s_htim4_test.Init.Period            = 1999U;
    s_htim4_test.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    s_htim4_test.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_PWM_Init(&s_htim4_test) != HAL_OK) {
        return;
    }

    TIM_OC_InitTypeDef oc = {0};
    oc.OCMode     = TIM_OCMODE_PWM1;
    oc.Pulse      = 150U;  /* 1.5ms 脉宽（中位） */
    oc.OCPolarity = TIM_OCPOLARITY_HIGH;
    oc.OCFastMode = TIM_OCFAST_DISABLE;
    if (HAL_TIM_PWM_ConfigChannel(&s_htim4_test, &oc, TIM_CHANNEL_4) != HAL_OK) {
        return;
    }

    (void)HAL_TIM_PWM_Start(&s_htim4_test, TIM_CHANNEL_4);
}

/* PD15 PWM 与 power 同步：power 0 -> 1ms 脉宽，power 1000 -> 2ms 脉宽（50Hz 周期 20ms） */
void ESC_TestPwm_SetPower(uint16_t power_0_1000)
{
    if (power_0_1000 > 1000U) power_0_1000 = 1000U;
    /* 100 ticks=1ms, 200 ticks=2ms */
    uint32_t pulse = 100U + (uint32_t)power_0_1000 * 100U / 1000U;
    __HAL_TIM_SET_COMPARE(&s_htim4_test, TIM_CHANNEL_4, (uint32_t)pulse);
}

ESC_Status_t ESC_SetThrottleRaw(ESC_Channel_t ch, uint16_t dshot_value, bool request_telemetry)
{
    if (ch >= ESC_CH_COUNT)  { return ESC_ERR_PARAM;    }
    if (!s_dbg.initialized)  { return ESC_ERR_NOT_INIT; }
    if (dshot_value > 2047U) { dshot_value = 2047U;     }

    s_pending_val[ch] = dshot_value;
    s_pending_tel[ch] = request_telemetry ? 1U : 0U;
    return ESC_OK;
}

ESC_Status_t ESC_SetThrottleBidirectional(ESC_Channel_t ch, int16_t throttle)
{
    return ESC_SetThrottleBidirectionalEx(ch, throttle, false);
}

ESC_Status_t ESC_SetThrottleBidirectionalEx(ESC_Channel_t ch, int16_t throttle, bool request_telemetry)
{
    uint16_t dshot_val;
    if (throttle <= 0) {
        dshot_val = 0U;
    } else {
        uint32_t t = (uint32_t)throttle;
        if (t > 1000U) { t = 1000U; }
        /* 1..1000 线性映射 -> DShot 48..2047 */
        dshot_val = (uint16_t)(48U + (t - 1U) * (2047U - 48U) / 999U);
    }
    return ESC_SetThrottleRaw(ch, dshot_val, request_telemetry);
}

ESC_Status_t ESC_SetInputMapped(ESC_Channel_t ch, uint16_t input_value)
{
    uint16_t dshot_val;
    if (input_value == 0U) {
        dshot_val = 0U;
    } else {
        uint32_t v = input_value;
        if (v > 1000U) { v = 1000U; }
        dshot_val = (uint16_t)(48U + (v - 1U) * (2047U - 48U) / 999U);
    }
    return ESC_SetThrottleRaw(ch, dshot_val, false);
}

ESC_Status_t ESC_Update(void)
{
    if (!s_dbg.initialized) { return ESC_ERR_NOT_INIT; }
    s_dbg.update_req_count++;

    if (s_dma_busy) {
        s_dbg.update_busy_reject_count++;
        return ESC_ERR_BUSY;
    }
    s_rx_start_pending = 0U;
    s_esc_tx_dma_done_bits = 0U;
    s_esc_tx_expect_mask    = 0U;

    ESC_Tim2ConfigTx();

    {
        TIM_OC_InitTypeDef oc = {0};
        oc.OCMode     = TIM_OCMODE_PWM1;
        oc.Pulse      = 0U;
        oc.OCPolarity = TIM_OCPOLARITY_HIGH;
        oc.OCFastMode = TIM_OCFAST_DISABLE;
        (void)HAL_TIM_PWM_ConfigChannel(&s_htim2, &oc, TIM_CHANNEL_3);
        (void)HAL_TIM_PWM_ConfigChannel(&s_htim2, &oc, TIM_CHANNEL_4);
    }

    /* 每次发送前恢复为 TIM2 复用输出（上一次发送完成后会被切回 GPIO 低电平） */
    ESC_PinsToAF_TIM2_CH3_CH4();

    /* 切到 AF 后通道尚未使能，引脚会浮空导致信号线电压线性上升；立即用 TIM 驱动为低（CCR=0 并开启输出），再启动 DMA */
    s_htim2.Instance->CCR3 = 0U;
    s_htim2.Instance->CCR4 = 0U;
    s_htim2.Instance->CCER |= (TIM_CCER_CC3E | TIM_CCER_CC4E);

    /* 编帧 */
    encode_frame(s_buf_ch3, s_pending_val[ESC_CH1], (bool)s_pending_tel[ESC_CH1]);
    encode_frame(s_buf_ch4, s_pending_val[ESC_CH2], (bool)s_pending_tel[ESC_CH2]);

    /* 刷 D-Cache -> SRAM，确保 DMA 读到最新内容（缓冲区已 32 字节对齐）*/
    SCB_CleanDCache_by_Addr((uint32_t *)s_buf_ch3, (int32_t)DSHOT_BUF_BYTES);
    SCB_CleanDCache_by_Addr((uint32_t *)s_buf_ch4, (int32_t)DSHOT_BUF_BYTES);

    s_dbg.last_raw_ch1 = s_pending_val[ESC_CH1];
    s_dbg.last_raw_ch2 = s_pending_val[ESC_CH2];

    /* 重置计数器，保证每帧从周期起点开始（上帧 Stop_DMA 后计数器已停止）*/
    __HAL_TIM_SET_COUNTER(&s_htim2, 0U);

    /* 启动 DMA — CH3 (PA2) */
    if (HAL_TIM_PWM_Start_DMA(&s_htim2, TIM_CHANNEL_3,
                               s_buf_ch3, DSHOT_FRAME_LEN) == HAL_OK) {
        s_dma_busy |= DMA_BUSY_CH3_TX;
        s_esc_tx_expect_mask |= ESC_TX_DMA_DONE_CH3;
    } else {
        s_dbg.start_dma_ch3_fail_count++;
    }

    /* 启动 DMA — CH4 (PA3)：ChannelState[3] 与 ChannelState[2] 独立，无冲突 */
    if (HAL_TIM_PWM_Start_DMA(&s_htim2, TIM_CHANNEL_4,
                               s_buf_ch4, DSHOT_FRAME_LEN) == HAL_OK) {
        s_dma_busy |= DMA_BUSY_CH4_TX;
        s_esc_tx_expect_mask |= ESC_TX_DMA_DONE_CH4;
    } else {
        s_dbg.start_dma_ch4_fail_count++;
    }

    s_dbg.dma_busy = s_dma_busy;
    s_dbg.update_ok_count++;
    return ESC_OK;
}

bool ESC_IsBusy(void)
{
    return (s_dma_busy != 0U);
}

void ESC_GetDebugInfo(ESC_DebugInfo_t *info)
{
    if (info != NULL) { *info = s_dbg; }
}

bool ESC_GetTelemetry(ESC_Channel_t ch, ESC_Telemetry_t *out)
{
    if (ch >= ESC_CH_COUNT || out == NULL) {
        return false;
    }
    *out = s_telem[ch];
    s_telem[ch].updated = 0U;
    return (out->valid != 0U);
}

void ESC_Service_Init(void)
{
    for (uint8_t ch = 0U; ch < ESC_CH_COUNT; ch++) {
        s_service_cmd[ch].throttle = 0;
        s_service_cmd[ch].request_telemetry = 0U;
        s_service_state[ch].initialized = 1U;
        s_service_state[ch].last_update_ok = 1U;
    }
}

ESC_Status_t ESC_Service_WriteCommand(ESC_Channel_t ch, int16_t throttle, bool request_telemetry)
{
    if (ch >= ESC_CH_COUNT) {
        return ESC_ERR_PARAM;
    }
    if (throttle < 0) {
        throttle = 0;
    } else if (throttle > 1000) {
        throttle = 1000;
    }
    s_service_cmd[ch].throttle = throttle;
    s_service_cmd[ch].request_telemetry = request_telemetry ? 1U : 0U;
    return ESC_OK;
}

void ESC_Service_Tick(void)
{
    ESC_Status_t st = ESC_OK;

    for (uint8_t ch = 0U; ch < ESC_CH_COUNT; ch++) {
        s_service_state[ch].tick_count++;
        st = ESC_SetThrottleBidirectionalEx((ESC_Channel_t)ch,
                                            s_service_cmd[ch].throttle,
                                            (s_service_cmd[ch].request_telemetry != 0U));
        if (st != ESC_OK) {
            s_service_state[ch].last_update_ok = 0U;
            s_service_state[ch].update_err_count++;
        }
    }

    ESC_RecoverIfStuck(2U);
    if (!ESC_IsBusy()) {
        st = ESC_Update();
        for (uint8_t ch = 0U; ch < ESC_CH_COUNT; ch++) {
            if (st == ESC_OK) {
                s_service_state[ch].last_update_ok = 1U;
                s_service_state[ch].update_ok_count++;
            } else {
                s_service_state[ch].last_update_ok = 0U;
                s_service_state[ch].update_err_count++;
            }
        }
    }

    for (uint8_t ch = 0U; ch < ESC_CH_COUNT; ch++) {
        ESC_Telemetry_t t;
        if (ESC_GetTelemetry((ESC_Channel_t)ch, &t) && t.updated) {
            s_service_state[ch].last_telemetry = t;
            s_service_state[ch].rx_ok_count++;
        } else if (t.updated) {
            s_service_state[ch].last_telemetry = t;
            s_service_state[ch].rx_err_count++;
        }
    }
}

bool ESC_Service_ReadState(ESC_Channel_t ch, ESC_ServiceState_t *out)
{
    if (ch >= ESC_CH_COUNT || out == NULL) {
        return false;
    }
    *out = s_service_state[ch];
    return true;
}

void ESC_RecoverIfStuck(uint32_t timeout_ms)
{
    static uint32_t s_stuck_since_ms = 0U;

    if (!s_dma_busy) {
        s_stuck_since_ms = 0U;
        return;
    }

    uint32_t now = HAL_GetTick();
    if (s_stuck_since_ms == 0U) {
        s_stuck_since_ms = now;
        return;
    }

    if ((now - s_stuck_since_ms) >= timeout_ms) {
        /* 强制停止：清 CCxDE、中止 DMA、禁用通道输出、关闭计数器 */
        HAL_TIM_PWM_Stop_DMA(&s_htim2, TIM_CHANNEL_3);
        HAL_TIM_PWM_Stop_DMA(&s_htim2, TIM_CHANNEL_4);
        ESC_StopRxChannel(ESC_CH1);
        ESC_StopRxChannel(ESC_CH2);
        s_rx_start_pending       = 0U;
        s_esc_tx_dma_done_bits   = 0U;
        s_esc_tx_expect_mask     = 0U;
        s_dma_busy               = 0U;
        s_dbg.dma_busy           = 0U;
        s_dbg.stuck_recover_count++;
        s_stuck_since_ms         = 0U;
    }

    for (uint8_t ch = 0U; ch < ESC_CH_COUNT; ch++) {
        if (s_rx[ch].active && (now - s_rx[ch].start_ms) >= ESC_RX_TIMEOUT_MS) {
            ESC_FinishRxChannel((ESC_Channel_t)ch);
        }
    }
}
